# Задания Решу ЕГЭ:
## Тип(2) Задание 1 (33504) 
Логическая функция F задаётся выражением ((x ≡ ¬y) → (y ∧ ¬z)) ∨ (z ∧ ¬w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(((x == (not(y))) <= (y and not(z))) or (z and not(w))):
                    print(x, y, z, w)
```
## Тип(2) Задание 2 (33081)
Логическая функция F задаётся выражением (x ∨ ¬z) ∧ (x ≡ ¬w) ∧ (x → y). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if (x or not(z)) and (x == (not(w))) and (x <= y):
                    print(x, y, z, w)
```
## Тип(2) Задание 3 (63051)
Логическая функция F задаётся выражением: ((z → w) ∧ (y ≡ ¬x))→(u ≡ (y ∨ z)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
```
print("x y z w u")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                for u in range(0, 2):
                    if not(((z <= w)and(y == (not(x)))) <= (u == (y or z))):
                        print(x, y, z, w, u)
```

-------------------------------------------------------

## Тип(8) Задание 1 (3700)
Все 5-⁠буквенные слова, составленные из букв Б, К, Ф, Ц, записаны в алфавитном порядке и пронумерованы. Вот начало списка: 1.  БББББ 2.  ББББК 3.  ББББФ 4.  ББББЦ 5.  БББКБ
```
a = {0: "Б", 1: "К", 2: "Ф", 3: "Ц"}
k = 0
for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if k == 486:
                        print(a[i], a[j], a[g], a[m], a[n], end=" ")
```
## Тип(8) Задание 2 (18816)
Петя составляет 3-⁠буквенные слова из букв Р, У, Ч, К, А причем буква К должна встречаться в слове ровно 1 раз. Сколько различных слов может составить Петя?
```
import itertools
alphabet = "РУЧКА"
ar = itertools.product(alphabet, repeat=3) #Размещение с повторением
arl = []
for i in ar:
    arl.append(list(i))
count = 0
for e in arl:
    if e.count("К") == 1:
        count += 1
print(count)
```
## Тип(8) Задание 3 (58240)
Сколько существует различных пятизначных чисел, записанных в девятеричной системе счисления, в записи которых цифры следуют слева направо в убывающем порядке?
```
k = 0
for i1 in range(9):
    for i2 in range(9):
        for i3 in range(9):
            for i4 in range(9):
                for i5 in range(9):
                    if i1 > i2 and i2 > i3 and i3 > i4 and i4 > i5:
                        k += 1
print(k)
```
