# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:
1) Строится двоичная запись числа N.
2) Затем снова дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.
3) Полученная таким образом запись (в ней два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число R, большее 130, которое может являтсья результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
for n in range(1, 100):
    r = bin(n) [2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    if int(r, 2) > 130:
        print(int(r, 2))
```
# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:
1)Строится двоичная запимсь числа N.
2)К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если чётное.
3)К полученному результату дописывается ещё один бит чётности.
Полученная таким образом запись (в ней на два раза больше, чем записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе
```
n = int(input()) #ввод значения переменной 'n'
r = bin(n) [2:] #переменная 'r' является переводом переменной 'n' в бинарный код
print(r) #вывести переменную 'r'
if r.count('1') % 2 == 0: #проверить четность числа
    r += '0' #переменной 'r' присваивается 0 в конце
else: #или же
    r += '1' #присваивается 1 в конце
print(r) #вывести переменную 'r'
if r.count('1') % 2 == 0: #проверить четность числа
    r += '0' #присваивается 0 в конце
else: #или же
    r += '1' #присваивается 1 в конце
print(r) #вывести переменную 'r'
```
