# Задание 1
## На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:
1) Строится двоичная запись числа N.
2) Затем снова дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.
3) Полученная таким образом запись (в ней два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число R, большее 130, которое может являтсья результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
for n in range(1, 100):  # Перебираем все натуральные числа N от 1 до 99
    # (на практике можно было бы и до меньшего значения, но для надёжности взяли 100)
    
    r = bin(n)[2:]  # Получаем двоичную запись числа N без префикса '0b'
    # bin(5) вернёт '0b101', а [2:] отсекает первые два символа, оставляя '101'
    
    if n % 2 == 0:  # Проверяем, чётное ли число N
        r += '01'   # Если чётное, дописываем справа '01' (согласно условию)
    else:           # Иначе (число нечётное)
        r += '10'   # Дописываем справа '10' (согласно условию)
    
    if int(r, 2) > 130:  # Преобразуем полученную двоичную строку обратно в число
        # и проверяем, превышает ли оно 130 (ищем числа больше 130)
        
        print(int(r, 2))  # Выводим все числа R, которые больше 130
        # Программа выведет несколько чисел, первое из них (минимальное) будет ответом
```

# Задание 2
## На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:
1) Строится двоичная запимсь числа N.
2) К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если чётное.
3) К полученному результату дописывается ещё один бит чётности.
Полученная таким образом запись (в ней на два раза больше, чем записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе
```
n = int(input()) #ввод значения переменной 'n'
r = bin(n) [2:] #переменная 'r' является переводом переменной 'n' в бинарный код
print(r) #вывести переменную 'r'
if r.count('1') % 2 == 0: #проверить четность числа
    r += '0' #переменной 'r' присваивается 0 в конце
else: #или же
    r += '1' #присваивается 1 в конце
print(r) #вывести переменную 'r'
if r.count('1') % 2 == 0: #проверить четность числа
    r += '0' #присваивается 0 в конце
else: #или же
    r += '1' #присваивается 1 в конце
print(r) #вывести переменную 'r'
```

# Задание 3 пример 1
## Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку (126849, 126871), числа, имеющие ровно 4 различных делителя. Выведите эти четеры делителя для каждого найденного числа в порядке возрастания.
```
for x in range(126849, 126872): #задаем диапозон чисел
    c = 0 #присваиваем переменной 'с' число 0
    for i in range(1, x+1): #задаем переменной 'i' диапозон чисел от 1 до х+1
        if x % i == 0: #если 'х' деленное нацело равно нулю
            c += 1 #переменная 'с' + 1
    if c == 4: #если 'с' равно 4
        print(x) #вывести 'х'
```

# Задание 3 пример 2
## Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку (126849, 126871), числа, имеющие ровно 4 различных делителя. Выведите эти четеры делителя для каждого найденного числа в порядке возрастания.
```
for x in range(126849, 126872): #задаем диапозон чисел
    c = set() #присваиваем переменной 'с' число 0
    for i in range(1, x+1): #задаем переменной 'i' диапозон чисел от 1 до х+1
        if x % i == 0: #если 'х' деленное нацело равно нулю
            c.add(i) #переменная 'i' добавляется в множество переменной 'с'
    if len(c) == 4: #если 'с' равно 4
        print(*sorted(c)) #вывести и отсортировать 'с'
```
